CinemaApp/app/controllers/movies_controller.rb

  def create
    @movie = Movie.new
    duration = params[:duration].split(':')
    @info = Info.new(
      duration: Integer(duration[0]) * 3600 + Integer(duration[1]) * 60,
      release_date: Date.parse(params[:release_date]),
      rating: Rating.find(params[:rating]),
      movie: @movie
    )
    @description = Description.new(
      title: params[:title],
      summary: params[:summary],
      genre: Genre.find(params[:genre]),
      movie: @movie
    )

    respond_to do |format|
      if @movie.save && @info.save && @description.save
---
INSERT INTO "movies" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-11-28 07:20:56.073535"], ["updated_at", "2017-11-28 07:20:56.073535"]]