CinemaApp/app/views/movies/_form.html.erb

    <%= label(:movie, "genre") %>
    <%= select_tag("genre",
      options_from_collection_for_select(Genre.all, "id", "name")) %>
---
SELECT "genres".* FROM "genres"

    <%= label(:movie, "rating") %>
    <%= select_tag("rating",
      options_from_collection_for_select(Rating.all, "id", "name")) %>
---
SELECT "ratings".* FROM "ratings"